; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v3)
		(pred_2 ?v5)
		(pred_5 ?v8)
		(pred_6 ?v8)
		(pred_1 ?v5 ?v8)
		(pred_4)
		(pred_3 ?v5))

   (:action op_2
       :parameters  (?v6 ?v4)
       :precondition (and (not-eq ?v6 ?v4) 
                          (pred_5 ?v6) (pred_5 ?v4) (pred_6 ?v6))
       :effect (and  (pred_6 ?v4)
		     (not (pred_6 ?v6))))


   (:action op_3
       :parameters (?v1 ?v2)
       :precondition  (and  (pred_2 ?v1) (pred_5 ?v2)
			    (pred_1 ?v1 ?v2) (pred_6 ?v2) (pred_4))
       :effect (and (pred_3 ?v1)
		    (not (pred_1 ?v1 ?v2)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v1  ?v2)
       :precondition  (and  (pred_2 ?v1) (pred_5 ?v2)
			    (pred_3 ?v1) (pred_6 ?v2))
       :effect (and (pred_1 ?v1 ?v2)
		    (pred_4)
		    (not (pred_3 ?v1)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_07 obj_02 obj_01 obj_04 obj_05 
          obj_03 obj_06 
)
(:init
(pred_5 obj_07)
(pred_5 obj_02)
(pred_5 obj_01)
(pred_5 obj_04)
(pred_5 obj_05)
(pred_2 obj_03)
(pred_2 obj_06)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(pred_4)
(pred_1 obj_03 obj_05)
(pred_1 obj_06 obj_07)
(pred_6 obj_01)
)
(:goal
(and
(pred_1 obj_03 obj_05)
(pred_1 obj_06 obj_04)
)
)

(:constraints
  (sometime-before  (pred_1 obj_06 obj_04) (pred_6 obj_02))
)
)

; plan
1. (op_2 obj_01 obj_07)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_07)
   goals met: 1 of 2
2. (op_3 obj_06 obj_07)
   deleted: (pred_1 obj_06 obj_07) (pred_4)
   added: (pred_3 obj_06)
   goals met: 1 of 2
3. (op_2 obj_07 obj_05)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_05)
   goals met: 1 of 2
4. (op_1 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_1 obj_06 obj_05) (pred_4)
   goals met: 1 of 2
5. (op_3 obj_03 obj_05)
   deleted: (pred_1 obj_03 obj_05) (pred_4)
   added: (pred_3 obj_03)
   goals met: 0 of 2
6. (op_2 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 0 of 2
7. (op_1 obj_03 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_1 obj_03 obj_02) (pred_4)
   goals met: 0 of 2
8. (op_2 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 0 of 2
9. (op_3 obj_06 obj_05)
   deleted: (pred_1 obj_06 obj_05) (pred_4)
   added: (pred_3 obj_06)
   goals met: 0 of 2
10. (op_2 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 0 of 2
11. (op_1 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_1 obj_06 obj_04) (pred_4)
   goals met: 1 of 2
12. (op_2 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 1 of 2
13. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03 obj_02) (pred_4)
   added: (pred_3 obj_03)
   goals met: 1 of 2
14. (op_2 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 1 of 2
15. (op_1 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_1 obj_03 obj_05) (pred_4)
   goals met: 2 of 2
